{"id":47,"article_id":"2","one_type":"19","two_type":"20","title":" EZVIZ DB1C Video Doorbell Review","main_title":"EZVIZ DB1C Video Doorbell Review: A Complete Guide","keyword":"EZVIZ DB1C video doorbell, EZVIZ logo, EZVIZ DBC1 ","description":" This video doorbell may be used in various situations, has a high level of sensitivity, and is simple to use. Nevertheless, it is impossible to power it with batteries, and does not support two-factor authentication for the sign-in process.","first_picture":"/uploadsImg/1671422613421.jpeg","content_id":"196,711,712,723,724,725,726,727,728,729","author_id":"7","release_time":"2022-10-12 00:00:00","insert_time":"2022-12-19 12:05:07","update_time":"2023-01-04 15:18:03","entered_by":"admin","topping_state":"0","topping_title":"","score":"4.5","author_introduction":"Lucas Jones is the Technical Editor. He has extensive experience in technology and gaming journalism, having published on multiple platforms. You will find him covering everything from smartphones and home computers to 3D printers and headsets.","author_head_portrait":"/uploadsImg/1671161760571.jpeg","author_name":"Lucas Jones","category_recommend_list":[{"id":48,"article_id":"3","one_type":"18","two_type":"20","title":" The Best Robot Vacuums for 2022 ","main_title":"Everything You Need to Know About the Best Robot Vacuums For 2022","keyword":"Robot vacuum cleaners, top models, iRobot, the j7+, Shark I.Q. Robot ","description":"Do you want to clean floors without effort? We&#39;ve evaluated the best robot vacuums to help you select the right one for your house. They&#39;re more powerful and affordable than ever. Vacuum cleaners have improved. Here is the list of best robot vacuum cleaners of 2022 you should purchase.","first_picture":"/uploadsImg/1671422885339.jpeg","content_id":"730,197,283,284,285,286,731,733,734","author_id":"7","release_time":"2022-10-12 00:00:00","insert_time":"2022-12-19 12:10:39","update_time":"2022-12-28 14:45:52","entered_by":"admin","topping_state":"0","topping_title":"null","score":"4.5","author_introduction":"Lucas Jones is the Technical Editor. He has extensive experience in technology and gaming journalism, having published on multiple platforms. You will find him covering everything from smartphones and home computers to 3D printers and headsets.","author_head_portrait":"/uploadsImg/1671161760571.jpeg","author_name":"Lucas Jones","type":1,"time_en":"Oct 12, 2022"},{"id":46,"article_id":"1","one_type":"18","two_type":"20","title":" Best Vacuum Cleaners for Home ","main_title":"Best Vacuum Cleaners for Home for 2022","keyword":" greatest vacuum cleaner, Dyson V12 Detect Slim, Shark Navigator Lift-Away NV352 ","description":" The best vacuum cleaners for home to make light work of household chores. This post shares the top 5 vacuum cleaners for you.","first_picture":"/uploadsImg/1671421879651.jpeg","content_id":"656,195,278,279,280,281,692,693","author_id":"7","release_time":"2022-10-12 00:00:00","insert_time":"2022-12-19 12:01:45","update_time":"2022-12-28 14:44:33","entered_by":"admin","topping_state":"0","topping_title":"","score":"5","author_introduction":"Lucas Jones is the Technical Editor. He has extensive experience in technology and gaming journalism, having published on multiple platforms. You will find him covering everything from smartphones and home computers to 3D printers and headsets.","author_head_portrait":"/uploadsImg/1671161760571.jpeg","author_name":"Lucas Jones","type":1,"time_en":"Oct 12, 2022"}],"newest_recommend":[{"id":138,"article_id":"90","one_type":"19","two_type":"21","title":"Pyramid Credit Repair review","main_title":"Outstanding Review Of Pyramid Credit Repair","keyword":"Pyramid Credit Repair,credit reports,transparent price structure","description":"The credit repair business is about to see significant shifts because of Pyramid Credit Repair. Millions of Americans have benefited from our innovative methods, which provide access to adequate resources and round-the-clock guidance. We debunk the myth that credit restoration must be a tedious enterprise with onerous contracts, vague procedures, and disappointing outcomes. ","first_picture":"/uploadsImg/1671504995248.jpeg","content_id":"400,648,649,650,651,652,653,654","author_id":"8","release_time":"2022-11-13 00:00:00","insert_time":"2022-12-20 10:59:31","update_time":"2023-01-04 14:56:25","entered_by":"admin","topping_state":"0","topping_title":"null","score":"","author_introduction":"A senior writer focused on selecting and writing articles around the best goods for household, finance, tech and health.","author_head_portrait":"/uploadsImg/1671161773831.jpeg","author_name":"Jennifer Garcia","type":2,"time_en":"Nov 13, 2022"}],"content_list":[{"id":196,"content":"<p>The <b>EZVIZ DB1C video doorbell</b> may be permanently installed into your home's electrical system, relieving you of the burden of constantly checking the doorbell's battery life.</p><p> An extra lovely touch is that three more boxes are within the exterior wrapping box. The DB1C doorbell, chime, and power transformer are all housed in these containers.</p><p><br></p><p>If you're attempting to lessen the amount of plastic you use daily, you might want to reconsider buying these boxes because they're individually wrapped in plastic. Enough security for all of the inside boxes is provided by the outer box.</p><p><br></p><p>The camera comes with two plastic mounting plates, one of which is tilted so that the camera may be mounted at an oblique angle, a sticky pad to stabilize the camera when mounting on rough surfaces like a brick, and a comprehensive quick start guide written in 15 languages. About 12 pages of initialization are required, thankfully, for each language.</p><p><br></p><p>A drill bit, a handy double-ended screwdriver, screws and wall plugs, wire connections, and mounting screws are included in the bag, in addition to a power kit, which is a little white box with a tiny connector port if you need to connect it to existing doorbell wiring. The camera's body is lightweight and compact at 102g and 128 x 46 x 20mm. To insert an SD card into the camera, you'll need to remove a panel covering the slot, which may be done with the tip of a little screwdriver.</p><p><br></p><p><img src=\"/uploadsImg/1671422651527.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>The SD card must also be initialized using the EZVIZ program before it can be used. The cloud storage options available with the EZVIZ DB1C Video Doorbell are all quite inexpensive, making this product a good buy. In addition, the video quality is excellent, and it comes with several helpful extras that help it stand out in the increasingly crowded market for video doorbells. It’s not as adaptable as other battery-operated doorbells, though. We also discovered that the AI's person detection wasn't as accurate as we would have liked.</p><p><br></p><h2><br></h2><p><br></p><h2><br></h2><p><br></p><h2><br></h2>","amazon_adv_id":"635","score":"5","subtitle":"","amazon_adv":[{"id":635,"picture":"/uploadsImg/1672198244149.jpeg","title":"‎EZVIZ","original_price":"$117.99","actual_price":"$117.99","specifications":"EZDB11B3","link":"null","description":"null"}]},{"id":711,"content":"<h2><b>Specs For EZVIZ Db1c Video Doorbell</b><b></b></h2><p><br></p><p>● 5.05 x 1.82 x 0.76 inches in size</p><p>● Video resolution is 1536 × 1536 pixels at 15 frames per second (H.265/H.264 compression)</p><p>● Viewing angle 170 degrees (vertical)</p><p>● IP65 for weather resistance (designed for indoor and outdoor use)</p><p>● a/b/g/n 802.11 wireless (2.4GHz and 5 GHz dual bands)</p><p>● Power necessities<b>:</b> AC 12V to 24V hardwire connection is necessary.</p><p>● Operating range: 22 to 142 degrees Fahrenheit</p><p><br></p><p>This compact, competent video doorbell did an excellent job of collecting motion, but it lacks two-factor authentication and needs to have more dependable smart features.</p><p><br></p><h2>Pros</h2><p><br></p><p>+reasonably affordable</p><p><br></p><p>+Versatile</p><p><br></p><p>+Excellent audio and visual quality</p><p><br></p><p>+includes technology for smart homes</p><p><br></p><h2>Cons</h2><p><br></p><p>-only hardwired</p><p><br></p><p>-excludes the use of two factors for authentication when logging in</p><p><br></p><p>-The AI's human detecting capability proved unreliable.</p><p><br></p>","amazon_adv_id":"","score":"","subtitle":"Specification","amazon_adv":[]},{"id":712,"content":"<p>The form factor of the EZVIZ DB1C Wi-Fi Video Doorbell is both pleasant and modern. It measures a little over 5 inches in height, 1 3/4 inches in width, and 3/4 inches in depth, and has rounded edges. It's a triangular object with three circles. The lower circular button is the doorbell, while the upper one contains the camera. An opening for a microphone may be found directly below the camera module. Between the two lower circles, the <b>EZVIZ logo</b> is printed. A MicroSD card slot may be found on the right side of the device. The microSD card inside is safeguarded and kept securely in place by a cover that screws into place.<br></p><p><br></p><p><img src=\"/uploadsImg/1671422676257.png\" alt=\"\"></p><p><br></p><p>There are also two slanted brackets provided to facilitate setup and positioning. The doorbell's main unit is secured to the floor by a security screw, and the faceplate snaps into the bracket after installation. The EZVIZ DB1C can withstand temperatures from -22 degrees Fahrenheit (-30 degrees Celsius) to 140 degrees Fahrenheit (60 degrees Celsius) and has an IP65 weather rating.</p><p><br></p><p>There were enough parts of setting up the doorbell, but the DB1 had more. It has a removable faceplate in one of three colors, and that faceplate screws on to protect the microSD card and its contents from prying eyes. The DB1C's removable faceplate and accompanying reset button make it possible for any user to factory reset the device at their discretion.</p>","amazon_adv_id":"","score":"","subtitle":"Design","amazon_adv":[]},{"id":723,"content":"<h2><span style=\"font-weight: normal;\"><span style=\"font-size: 16px;\">Once it's set up, the </span><span style=\"font-size: 16px;\">EZVIZ DBC1</span><span style=\"font-size: 16px;\"> works like any other video doorbell. Your phone will ring, and a full-screen, image-based notice will show when the doorbell rings. This alert displays a handy feature, even if your phone is locked.</span></span><br></h2><p><br></p><p>At its base, the visual alert has two action buttons—accept or decline. If someone rings your doorbell and clicks \"answer,\" you can start talking to them. Recalling the previous situation, tapping the response button bypasses the need to unlock the phone before entering the app. This helps you get to the door faster when the doorbell rings. The call is ended, and the phone is restored to its locked state after it is finished.</p>","amazon_adv_id":"","score":"","subtitle":"Ease of Use","amazon_adv":[]},{"id":724,"content":"<h2><br></h2><p><br></p><p>If you've read our evaluations of other EZVIZ products, you'll recognize this as the same software used for other products. It has been updated since we last reviewed it with a modern appearance but otherwise has the same features. Using the EZVIZ DB1C Wi-Fi Video Doorbell necessitates the EZVIZ app, which can be downloaded from Google Play or Apple App Stores. The app's main screen provides a visual summary of any EZVIZ cameras you have set up. When you launch the app, it will capture a snapshot of the current time. You may access the live feed and your cloud and local video archives by clicking on the picture.</p><p><br></p><p>The app shows a yellow block on the timeline wherever it detects motion when reviewing previously recorded footage. Thanks to the camera's ability to record for the duration of the action rather than for a fixed amount of time, these blocks will have varying widths.</p><p><br></p><p>To access the doorbell configurations, tap the &gt;'''''''' symbol in the bottom right of the picture while on the main screen. Answering doorbell calls, audio, status light, infrared light, alarm notification, time and date, Wi-Fi, picture encryption, and offline notifications are some options you may tweak. You can also reach this menu when using the camera by touching the gear icon in the screen's top right corner.</p><p><br></p><p>Toggle between human shape and picture change detection, create a notice schedule, and fine-tune your motion detection region from Alarm Notification settings. I wouldn't say I liked that the EZVIZ DB1 didn't let you select a smaller detection region. The DB1C allows you to select the area you wish to receive notifications for by tapping on individual grid cells. Doing so can reduce the likelihood of your doorbell being accidentally triggered by passing vehicles or pedestrians on the street in front of your home.</p><p><br></p><p>Notifications may be accessed from the bottom right corner of the home screen. In a section of the app dubbed \"Library,\" a red notification dot indicates the total number of unread notifications. When you tap this, you'll be sent to the notifications screen where you can see alerts for all of your EZVIZ gadgets and browse through the days to see what you missed.</p><p><br></p><p>Finally, tapping the profile picture in the upper left corner of the app will allow you to make changes to your profile, view previously captured photos and videos, modify the app's overall settings, grant access to the doorbell to friends, and family, create an account for cloud storage, and activate smart integrations like Alexa, Google Assistant, and IFTTT.</p>","amazon_adv_id":"","score":"","subtitle":"Android Application","amazon_adv":[]},{"id":725,"content":"<h2><br></h2><p><br></p><p>After being installed, the camera functioned normally as a doorbell cam should. To a high degree of accuracy, it picked up on movement occurrences. You can quickly adjust it so it only alerts you when it should, thanks to features like motion zone setting and the option to switch between human form and image change detection.</p><p><br></p><p><img src=\"/uploadsImg/1671703106892.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>Occasional The mobile app gave me an error about the quality of my Wi-Fi connection and recommended a lesser resolution. It has a good signal because the doorbell is approximately 20 feet away from the router. Even though I have it set at the maximum quality and occasionally throw that issue, it has otherwise been functioning well.</p><p>Camera</p><p><br></p><p>The resolution of the EZVIZ DB1C is, in fact, lower than that of the DB1. The DB1C has a resolution of 1536 pixels across and 1536 pixels high, as opposed to 2048 by 1536 picture size. Additionally, as opposed to the DB1's 2.2mm/F2.4 lens, this one features a 2.1mm/F2.4 lens that offers a viewing angle of 170 degrees. The framerate is also significantly reduced, coming in at 15 fps as opposed to the DB1's 30 fps.</p><p><br></p><p>The image quality is fairly good regarding doorbell cameras, whether during the day or utilizing night vision when it's dark out. This is true whether you're using day vision or night vision. You can make out the details of the object well enough to identify it if that becomes necessary.</p>","amazon_adv_id":"","score":"","subtitle":"Performance","amazon_adv":[]},{"id":726,"content":"<p>Through the smartphone app for two-way communications, the person who was ringing the doorbell could hear and comprehend what we were saying from the inside of the house. Although there was a very tiny delay, the audio is distinct and unmistakable.</p>","amazon_adv_id":"","score":"","subtitle":"Sound Quality","amazon_adv":[]},{"id":727,"content":"<p>The quality of the microphone is satisfactory, much like the quality of the sound output. When I answered the doorbell, I had no trouble hearing the person on the other side of the door, and I did not have to ask them to repeat themselves.</p><p><br></p>","amazon_adv_id":"","score":"","subtitle":"Quality of the Microphone","amazon_adv":[]},{"id":728,"content":"<p>The EZVIZ DB1C Wi-Fi Video Doorbell is available from both Amazon and Walmart and can be purchased for a price that is considered to be quite reasonable. It has several fantastic features, such as a detection zone that can be customized, local storage and storage on the cloud, a camera that has decent clarity, and fairly good audio. Although it is around $25 less expensive than the DB1, it does not have several additional components like alternative faceplates and has a somewhat less capable camera.</p><p><br></p>","amazon_adv_id":"","score":"","subtitle":"Price/Value","amazon_adv":[]},{"id":729,"content":"<p>The Ezviz DB1C Wi-Fi Video Doorbell is a cost-effective smart doorbell that offers clear HD video with a wide viewing angle, cloud and local video storage, voice control capabilities, and compatibility with various third-party smart devices.</p><p><br></p>","amazon_adv_id":"","score":"","subtitle":"Conclusion","amazon_adv":[]}]}