{"id":105,"article_id":"60","one_type":"19","two_type":"22","title":"Marshall Emberton speaker review","main_title":"Great Review Of Marshall Emberton As A Speaker In 2022","keyword":"Marshall Emberton,Emberton II speakers,companion app","description":"It's easy to mistake this Marshall Emberton Bluetooth headset for a cheap knockoff rather than the genuine article. The fact that it resembles a classic Marshall guitar amp so closely in miniature gives it an air of instant sophistication.","first_picture":"/uploadsImg/1671433522528.jpeg","content_id":"254","author_id":"7","release_time":"2022-12-19 00:00:00","insert_time":"2022-12-19 15:07:32","update_time":"2022-12-20 16:30:20","entered_by":"admin","topping_state":"0","topping_title":null,"score":"","author_introduction":"Lucas Jones is the Technical Editor for Top Ten Reviews. He has extensive experience in technology and gaming journalism, having published on multiple platforms. You will find him covering everything from smartphones and home computers to 3D printers and headsets.","author_head_portrait":"/uploadsImg/1671161760571.jpeg","author_name":"Lucas Jones","category_recommend_list":[{"id":81,"article_id":"36","one_type":"18","two_type":"22","title":" Best DVD ripper software: DVD copying apps","main_title":"Best DVD Rippers: Top Picks from WinX, Handbrake, and more","keyword":" the best DVD ripper software and copying apps to make working easier for you. This post shares the top 5 DVD ripper software and apps","description":" the best DVD ripper software and copying apps to make working easier for you. This post shares the top 5 DVD ripper software and apps","first_picture":"/uploadsImg/1671429437580.jpeg","content_id":"230,453,454,455,456","author_id":"8","release_time":"2022-10-13 00:00:00","insert_time":"2022-12-19 13:59:01","update_time":"2022-12-20 12:54:21","entered_by":"admin","topping_state":"0","topping_title":null,"score":"","author_introduction":"A senior writer focused on selecting and writing articles around the best goods for household, finance, tech and health.","author_head_portrait":"/uploadsImg/1671161773831.jpeg","author_name":"Jennifer Garcia","type":1},{"id":83,"article_id":"38","one_type":"18","two_type":"22","title":" Best Internet Filter Software","main_title":"Best Internet Filter Software: Top Picks from Qustodio, Net Nanny, and More","keyword":" Internet, software, kids","description":"The best internet filter software. Protecting your kids online requires investing in reliable internet filter software. Unfortunately, now more than ever, children are at risk because of the internet&#39;s ease of use. This post shares the top 5 best internet filter software for you","first_picture":"/uploadsImg/1671429735549.jpeg","content_id":"232,461,462,463,464","author_id":"8","release_time":"2022-10-13 00:00:00","insert_time":"2022-12-19 14:03:58","update_time":"2022-12-20 12:57:27","entered_by":"admin","topping_state":"0","topping_title":null,"score":"","author_introduction":"A senior writer focused on selecting and writing articles around the best goods for household, finance, tech and health.","author_head_portrait":"/uploadsImg/1671161773831.jpeg","author_name":"Jennifer Garcia","type":1}],"newest_recommend":[{"id":144,"article_id":"1211","one_type":"18","two_type":"23","title":"test title 1","main_title":"test title1-1","keyword":"1212","description":"this is a test wenzhang ","first_picture":"/uploadsImg/1671762656598.jpeg","content_id":"878,790,791,776,775,772,769,770,777","author_id":"8","release_time":"2022-12-23 00:00:00","insert_time":"2022-12-23 10:31:56","update_time":"2022-12-23 15:51:52","entered_by":"admin","topping_state":"1","topping_title":"test title","score":"5","author_introduction":"A senior writer focused on selecting and writing articles around the best goods for household, finance, tech and health.","author_head_portrait":"/uploadsImg/1671161773831.jpeg","author_name":"Jennifer Garcia","type":1}],"content_list":[{"id":254,"content":"<p>This same <b>Marshall Emberton</b> seems to be a sleek speaker that resembles a little guitar amp. A decent battery life but water resistance make this portable speaker enticing, even if its music output falls short of expectations. This speaker can withstand submersion in water up to a depth of 7 feet (IPX7), so you can take it to the beach or the pool without fear of ruining your music. Whereas Marshall Emberton is stylish and contains the essentials, it falls short in a few critical areas. It has a built-in microphone for taking calls but doesn't work with voice assistants. This ought to be anticipated from a portable speaker, but the microphone is a nice addition.</p><p><br></p><p>Furthermore, unlike many other Bluetooth speakers, there is no app support for adjusting the equalization. The device lacks even a 3.5 mm auxiliary input.The portable speaker behind that elegant appearance is a solid piece of gear in its own right, lacking a little power and additional functionality because of its price at $149.99 / £assessment to identify / AU$249.99, but tempting owing to being ultra-portable but instead roadworthy. Marshall Emberton is surprisingly straightforward for a Bluetooth speaker of its price range. It was a speaker that could withstand being tossed about in a bag and taken everywhere. It can be held with one hand and weighs just 0.7kg.</p><p><br></p><p>The Marshall Emberton Bluetooth Wireless Speaker. It's great for a wide variety of music since it has a well-balanced mid- and treble-range that faithfully reproduces voices and lead instruments while adding some additional boom and warmth to the bottom.</p><p><br></p><h2><b>Pros</b><b></b></h2><p><br></p><p>+ I think that's quite neat.</p><p>+ Strong and long-lasting construction.</p><p>+ Long-lasting batteries.</p><p><br></p><h2><b>Cons</b><b></b></h2><p><br></p><p>- We have no mic.</p><p>- A voice-activated assistant is not available.</p><p>- Lacking in strength when turned up to eleven.</p><p><br></p><h2><b>Specifications</b><b></b></h2><p><br></p><p><b>Bluetooth</b>:  5.0</p><p><b>Weight:  </b>0.7kg</p><p><b>Channels:  </b>Stereo</p><p><b>Bluetooth:  </b>Yes</p><p><b>Wi-Fi:  </b>No</p><p><b>Power Source:</b><b>  </b>Battery &amp;''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''' USB</p><p><b>Battery Life </b>:  9.3 hrs</p><p><br></p><h2><b>Design</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433585202.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>The black brick-shaped Emberton has a gray metallic mesh grille and the classic white script Marshall emblem on its front face. Dimensionally, it's very little, measuring 2.7 x 6.3 cm x 3.0 inches (HWD), yet it weighs a hefty 1.5 pounds. Although Marshall has updated the speaker, it still has the classic design of earlier generations. The center control panel has a brass finish, which nods to the past, and a red digital LED display on that top panel indicates the battery's charge level, which is quite contemporary. The speaker has Bluetooth 5.0 connectivity and a class-D amplifier powering twin 10-watt drivers.</p><p><br></p><p>The Emberton has a great IPX7 certification, which means it is entirely waterproof and can be submerged approximately to a meter (albeit Bluetooth signal doesn't perform well underwater). However, the USB-C connector on the right panel is not protected. The rain, the pool, and the kitchen sink shouldn't bother the speaker in the least. A sensitive four-way rocker in the middle of the device controls the volume, skips tracks, and plays/pause the currently playing track. Shorter pushes manage playback, whereas longer presses turn the speaker on or off. The Bluetooth pairing button is located to the left of the main control. The bottom is rubber-lined to prevent the speaker from sliding around on hard surfaces. A speakerphone feature is notably absent, given the size. There is no auxiliary input jack on the Emberton, and the USB port may only be used to charge the device.</p><p><br></p><h2><b>Performance</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433595488.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>Even at modest levels, the Emberton produces some surprisingly rich bass considering its size on tunes with heavy sub-bass content, such as \"Silent Shout\" by The Knife. At maximum intensity, the DSP machine learning kicks in, and although the speaker still pumps out many sounds, the bass impacts become notably less impactful. The trade-off for Emberton's mobility is a lack of bass oomph at maximum levels, which is anticipated given the size. By comparing it to \"Drover\" by Bill Callahan, a tune with far less sub-bass inside this mix, we may get a clearer idea of the overall sound design. At high settings, the drums on this track may sound thundering with bass-forward speakers, but somehow the Emberton renders them rich and natural over moderate volumes.</p><p><br></p><p>Callahan's rich baritone, however, is given enough of limited presence and perhaps some sharp treble edge at all levels. The acoustic strums are likewise rendered with dazzling clarity. This is not a consistent sound signature and varies significantly with loudness, making it unsuitable for purists. However, the Emberton sounds clean and well-balanced throughout the volume range. We discovered the sweet spot for loudness and bass response just a few notches below optimum.The producers of Jay-Z and Kanye West's \"No Chapel in the Wild\" gave the kick drum loop much more high-mid presence to keep its punchiness, and we can also hear the vinyl hiss and crackle that are typically relegated to the background in a somewhat amplified form.</p><p><br></p><p>The Emberton has trouble producing the sub-bass synth hits; they don't distort, although they're not very powerful, even at moderate volumes. However, at maximum power, the drum loop gains some bottom depth, and as before, things become sparse. The vocals on this recording are clear and undistorted, making them easy to understand. At high levels, orchestral music sounds excellent, like the prologue to John Adams' The Apocalypse According to a Different Mary. Lower-register instrumentation sounds full and rich, including its anchoring role, unaffected by the DSP, while relatively high brass, strings, and vocals retain their crispness and clarity. When the volume is dialed back, the bass takes center stage without becoming too dominant.</p><p><br></p><h2><b>Compared To The Second Generation</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433605533.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>Due to Emberton's striking visual continuity throughout generations, distinguishing between them might be challenging. A closer inspection of the Emberton II reveals several improvements that are not immediately apparent. The two speakers seem virtually similar, except the second one has a pebbled appearance on the outside. Moreover, its longevity is increased. Marshall upgraded from an IPX7 certification, which provides no dust protection, to an IP67 classification, which protects against dust and sand. Many people who like going to the beach will be quite happy. Marshall's internal Bluetooth version is now 5.1 rather than 5.0, and the battery life has been extended to 30 hours. The original Emberton lasted only 20 hours, but the new model increased it by a whopping 50 percent. Unfortunately, the most exciting new feature is also the one that most people won't ever use.</p><p><br></p><p>Stack mode enables a gigantic wall of speakers to be created by stacking numerous <b>Emberton II speakers </b>on top of one another. Multiple speakers may be stacked together to provide a more spectacular overall sound. However, this is of little use if you have one speaker and instead makes us think of rows and rows of vintage Marshall amps along the stage's perimeter. One plausible scenario is if you and your buddies agree to listen to the same speaker ahead of time so you can coordinate your efforts when you all get together.</p><p><br></p><h2><b>Sound Performance</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433615337.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>When you turn up on that Marshall Emberton II, you can immediately tell you're using a genuine Marshall product. We like the rough, almost rock-like quality of it. This doesn't mean that just rock or guitar-heavy music will sound well on this speaker. Everything sounded great. However, it wasn't much better than the first generation. We've tried several speakers in this price range, and none of them come close to matching the warmth and expansive soundstage of this one. When used inside, the speaker's maximum volume is too high to be comfortable unless the room is enormous. Our music has a satisfying rumble when played through the Emberton II, which produces a reasonable amount of bass. Thanks to testing other speakers beyond Marshall's limit, we haven't encountered any problems playing music at lower frequencies (below 60Hz). Those that produce greater bass in a compact form risk sounding muddy or overwhelming.</p><p>● This seemed to be a happy medium, with good bass to convey the intended meaning without rattling the speaker too much.</p><p>● The voices, in particular, were somewhat harsh, perhaps overly processed when the volume was reduced to its maximum.</p><p>● Our testing playlist revealed that Glitter and Gold highs were tight and detailed, while the voices were distinct and unmistakable.</p><p>● Switching to the World's Smallest Violin let the midrange frequencies stand out, and the shift between instruments was clear throughout the instrumental interludes.</p><p>● Among the top-performing genres were those we like, such as rock, jazz, ambient soundscapes, and especially acoustic tunes.</p><p><br></p><h2><b>App For Marshall Connect</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433630357.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>You may access hidden features by downloading your free Marshall Opportunity for people and connecting your phone to the speaker through Bluetooth. When there are available firmware upgrades, the app may assist you in installing them on your speaker. The app's main function is to fine-tune the speaker using one of three predefined equalization curves. There is no option for a manual EQ control. Either a Marshall or Push system or a voice system may be selected. By a wide margin, our favorite sound from this brand was the Marshall. The use of voice is particularly effective in audiobooks, podcasts, and other works that include extensive conversation. By boosting the highs and lows, the music becomes more forceful and hefty when using the \"Push\" button. While the bass was somewhat enhanced, our testing showed that Push significantly narrowed the stereo field and muddied the midrange. The trade-off was not worth it since Push sounded worse overall.</p><p><br></p><h2><b>What You Obtain</b><b></b></h2><p><br></p><p>Marshall Emberton stands out because of its design, reminiscent of guitar amplifiers. In the middle of the 'amp's' top panel is a gold, four-way 'joystick' that serves as its primary control mechanism. The device may turn on and off as a volume knob and track skip button. A subtle Bluetooth connectivity button and a red light that glows to show battery life are other notable features that refer to classic amp pilot lights. The lack of complexity is Marshall Emberton's biggest drawback. Without a 3.5mm audio jack and the ability to use a voice assistant, this device falls short in many respects. The fact that it can be charged quickly and has a long battery life (20 hours) makes it convenient to carry on the go, but otherwise, this is a basic Bluetooth speaker.</p><h2><b></b></h2><h2><b>Putting In Place</b><b></b></h2><p><br></p><p><img src=\"/uploadsImg/1671433637734.png\" style=\"max-width:100%;\" contenteditable=\"false\" alt=\"\"></p><p><br></p><p>The setup process is as simple as it gets. You may get started with Marshall Emberton immediately after pairing it with a device via Bluetooth. You can't adjust the equalization because of the lack of a <b>companion app</b>, but at least setting it up is quick and easy. The Emberton packs a punch for its compact size thanks to its two 10-watt speakers and dual class-D amplifiers. Its soundstage isn't nearly as broad as advertised, but it's still fairly listenable at moderate levels.</p><p><br></p><p>When listening to a classical composition that relies largely on instrumentals, the listener will notice the presence of smooth mids and clear trebles. A song like Childish Gambino's \"Feel Like Summer,\" with contrasting tones, is a good example of the enchantment he can spread. Marshall Emberton only falls short in the bass department, particularly at higher volumes. However, this speaker best suits more subdued settings, such as a lounge room or a study. Marshall Emberton isn't designed for music purists. Its sound quality is impressive for its small size and low cost, although its soundstage instead of bass could need some improvement. Furthermore, there is no EQ-adjusting companion app.</p><p><br></p><h2><b>Conclusion</b><b></b></h2><p><br></p><p>Marshall Emberton II ($169.99) Bluetooth speaker is an improvement over its predecessor in terms of battery life and builds quality. Still, these improvements (combined with the speaker's updated aesthetic) are insufficient to warrant the price tag. The digital signal processing is too strong, and the app lacks a speakerphone feature, but the equalization settings are great. More powerful outdoor speakers are available at a similar price, such as the JBL Full control 5 ($179.95), which won the Editors' Choice award. Regarding portable Bluetooth speakers, Marshall Emberton may be the best option or a little pricey, depending on your needs. Let us elaborate: The Emberton is more affordable than its rivals at $149, but it is smaller and has less power. However, its small size might be an advantage over many bigger, bulkier ones. There may be a little loss of bass when turning up the volume.</p>","amazon_adv_id":"407","score":"4.5","subtitle":null,"amazon_adv":[{"id":407,"picture":"/uploadsImg/1671525019852.jpeg","title":"Marshall Emberton speaker","original_price":"$247.90","actual_price":"$247.90","specifications":"","link":"https://amzn.to/3S4eYTP","description":""}]}]}